eringerli/esp32-aog/src/main.cpp
        switch ( initialisation.outputType ) {
          case SteerConfig::OutputType::SteeringMotorIBT2: {
            ledcWriteTone( 0, steerConfig.pwmFrequency );
            ledcWriteTone( 1, steerConfig.pwmFrequency );
          }
          break;
        }
      } );
      ESPUI.addControl( ControlType::Min, "Min", "1000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "5000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "100", ControlColor::Peterriver, num );
    }
  }

  // Steering PID Tab
  {
    uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Steering PID", "Steering PID" );

    ESPUI.addControl( ControlType::Switcher, "Allow AgOpenGPS to overwrite PID values", steerConfig.allowPidOverwrite ? "1" : "0", ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.allowPidOverwrite = control->value.toInt() == 1;
    } );

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Kp", String( steerConfig.steeringPidKp, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKp = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "50", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.1", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Ki", String( steerConfig.steeringPidKi, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKi = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "50", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.01", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Kd", String( steerConfig.steeringPidKd, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKd = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "50", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.01", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Automatic Bang On Factor (multiple of saturation with Kp, 0 to turn off)", String( steerConfig.steeringPidAutoBangOnFactor, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidAutoBangOnFactor = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "10", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.1", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Turn Output on if error is greater (BangOn)", String( steerConfig.steeringPidBangOn, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOn = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "50", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.01", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Turn Output off if error is smaller (BangOff)", String( steerConfig.steeringPidBangOff, 4 ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOff = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "50", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.01", ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Minimum PWM", String( steerConfig.steeringPidMinPwm ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidMinPwm = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "255", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
    }

//     {
//       uint16_t num = ESPUI.addControl( ControlType::Number, "Distance from Line to turn Integral/Derivative of PID off", String( steerConfig.steeringPidDflTurnIdOff ), ControlColor::Peterriver, tab,
//       []( Control * control, int id ) {
//         steerConfig.steeringPidDflTurnIdOff = control->value.toInt();
//       } );
//       ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
//       ESPUI.addControl( ControlType::Max, "Max", "200", ControlColor::Peterriver, num );
//       ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
//     }
  }

  // Sensors Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Sensors", "Sensors" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SDA Gpio*", String( ( int )steerConfig.gpioSDA ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSDA = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SCL Gpio*", String( ( int )steerConfig.gpioSCL ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSCL = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "I2C Bus Speed*",  String( steerConfig.i2cBusSpeed ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.i2cBusSpeed = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "10000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "5000000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1000", ControlColor::Peterriver, num );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "IMU*", String( ( int )steerConfig.imuType ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.imuType = ( SteerConfig::ImuType )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "No IMU", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "BNO055", "1", ControlColor::Alizarin, sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "IMU Orientation", String( ( int )steerConfig.imuOrientation ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.imuOrientation = ( SteerConfig::ImuOrientation )control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Option, "Forwards", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Right", "1", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Backwards", "2", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Left", "3", ControlColor::Alizarin, sel );
    }

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Inclinometer*", String( ( int )steerConfig.inclinoType ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.inclinoType = ( SteerConfig::InclinoType )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "No Inclinometer", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "MMA8451", "1", ControlColor::Alizarin, sel );
//       ESPUI.addControl( ControlType::Option, "DOGS2", "2", ControlColor::Alizarin, sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Inclinometer Orientation (Y-axis points:)", String( ( int )steerConfig.inclinoOrientation ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.inclinoOrientation = ( SteerConfig::InclinoOrientation )control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Option, "Forwards", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Backwards", "1", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Left", "2", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Right", "3", ControlColor::Alizarin, sel );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Roll Offset", String( steerConfig.rollOffset ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.rollOffset = control->value.toFloat();
      } );
      ESPUI.addControl( ControlType::Min, "Roll Min", "-10", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Roll Max", "10", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Roll Step", "0.01", ControlColor::Peterriver, num );
    }
  }

//   // Steering Wheel Encoder Tab
//   {
//     uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Steering Wheel Encoder", "Steering Wheel Encoder" );
//
//     ESPUI.addControl( ControlType::Switcher, "Steering Wheel Encoder*", steerConfig.steeringWheelEncoder ?"1" : "0", ControlColor::Wetasphalt, tab,
//     []( Control * control, int id ) {
//       steerConfig.steeringWheelEncoder = control->value.toInt() == 1;
//       setResetButtonToRed();
//     } );
//
//     {
//       uint16_t sel = ESPUI.addControl( ControlType::Select, "Steering Wheel Encoder Input A*", String( ( int )steerConfig.gpioWheelencoderA ), ControlColor::Wetasphalt, tab,
//       []( Control * control, int id ) {
//         steerConfig.gpioWheelencoderA = ( SteerConfig::Gpio )control->value.toInt();
//         setResetButtonToRed();
//       } );
//       ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
//       addGpioInput( sel );
//       addGpioOutput( sel );
//     }
//     {
//       uint16_t sel = ESPUI.addControl( ControlType::Select, "Steering Wheel Encoder Input B*", String( ( int )steerConfig.gpioWheelencoderB ), ControlColor::Wetasphalt, tab,
//       []( Control * control, int id ) {
//         steerConfig.gpioWheelencoderB = ( SteerConfig::Gpio )control->value.toInt();
//         setResetButtonToRed();
//       } );
//       ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
//       addGpioInput( sel );
//       addGpioOutput( sel );
//     }
//
//     ESPUI.addControl( ControlType::Number, "Steering Wheel Encoder max Counts", String( steerConfig.wheelEncoderPulseCountMax ), ControlColor::Peterriver, tab,
//     []( Control * control, int id ) {
//       steerConfig.wheelEncoderPulseCountMax = control->value.toInt();
//     } );
//   }

  // NTRIP/GPS Tab
  {
    uint16_t tab     = ESPUI.addControl( ControlType::Tab, "NTRIP/GPS", "NTRIP/GPS" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "RTK Correction*", String( ( int )steerConfig.rtkCorrectionType ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.rtkCorrectionType = ( SteerConfig::RtkCorrectionType )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "No Correction", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "NTRIP", "1", ControlColor::Alizarin, sel );
//       ESPUI.addControl( ControlType::Option, "UDP", "2", ControlColor::Alizarin, sel );
//       ESPUI.addControl( ControlType::Option, "TCP", "3", ControlColor::Alizarin, sel );
    }

    ESPUI.addControl( ControlType::Text, "Server*", String( steerConfig.rtkCorrectionServer ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionServer, sizeof( steerConfig.rtkCorrectionServer ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Username*", String( steerConfig.rtkCorrectionUsername ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionUsername, sizeof( steerConfig.rtkCorrectionUsername ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Password*", String( steerConfig.rtkCorrectionPassword ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionPassword, sizeof( steerConfig.rtkCorrectionPassword ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Mountpoint*", String( steerConfig.rtkCorrectionMountpoint ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionMountpoint, sizeof( steerConfig.rtkCorrectionMountpoint ) );
      setResetButtonToRed();
    } );
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Port*",  String( steerConfig.rtkCorrectionPort ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.rtkCorrectionPort = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "1", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
    }

    {
      uint16_t baudrate = ESPUI.addControl( ControlType::Select, "Baudrate*", String( steerConfig.rtkCorrectionBaudrate ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        uint32_t baudrate = control->value.toInt();
        steerConfig.rtkCorrectionBaudrate = baudrate;
        Serial2.flush();
        Serial2.begin( baudrate );
      } );
      ESPUI.addControl( ControlType::Option, "9600", "9600", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "19200", "19200", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "38400", "38400", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "57600", "57600", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "115200", "115200", ControlColor::Alizarin, baudrate );
    }

    ESPUI.addControl( ControlType::Number, "Intervall to send Position", String( steerConfig.ntripPositionSendIntervall ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.ntripPositionSendIntervall = control->value.toInt();
    } );

    textNmeaToSend = ESPUI.addControl( ControlType::Text, "NMEA-String to send (leave empty to send live position)", String( steerConfig.rtkCorrectionNmeaToSend ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionNmeaToSend, sizeof( steerConfig.rtkCorrectionNmeaToSend ) );
    } );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Send NMEA-data to", String( ( int )steerConfig.sendNmeaDataTo ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.sendNmeaDataTo = ( SteerConfig::SendNmeaDataTo )control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Option, "Nowhere", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "UDP", "1", ControlColor::Alizarin, sel );
//       ESPUI.addControl( ControlType::Option, "TCP", "2", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial", "3", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial1", "4", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial2", "5", ControlColor::Alizarin, sel );
//       ESPUI.addControl( ControlType::Option, "Bluetooth", "6", ControlColor::Alizarin, sel );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "TCP-Socket for distributing NMEA data (set to 0 to deactivate)*",  String( steerConfig.sendNmeaDataTcpPort ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.sendNmeaDataTcpPort = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
    }
  }

  i2cMutex = xSemaphoreCreateMutex();

  /*
   * .begin loads and serves all files from PROGMEM directly.
   * If you want to serve the files from SPIFFS use ESPUI.beginSPIFFS
   * (.prepareFileSystem has to be run in an empty sketch before)
   */

  /*
   * Optionally you can use HTTP BasicAuth. Keep in mind that this is NOT a
   * SECURE way of limiting access.
   * Anyone who is able to sniff traffic will be able to intercept your password
   * since it is transmitted in cleartext. Just add a username and password,
   * for example begin("ESPUI Control", "username", "password")
   */
  static String title = "AOG Control :: ";
  title += steerConfig.hostname;
  ESPUI.begin( title.c_str() );

  initIdleStats();

  initSensors();
  initRtkCorrection();

  initCan();

  initAutosteer();
}

void loop( void ) {
  dnsServer.processNextRequest();
  vTaskDelay( 100 );
}

